import React,{Fragment} from 'react';
import './writeCard.css'
export default class Protect  extends React.Component {

//查看协议页面

    render(){
        return(
            <Fragment>
            <div style={{clear: 'both'}} className="protocolFont">
                <p>用户服务协议</p>
                <p>一、声明与承诺</p><br/>
                <p>融资租赁公众号服务（以下简称“本服务”）是由上海证大融资租赁有限公司（以下简称“本公司”）向用户提供的代收、代付、代管、查询等服务。</p>
                <p>您确认，在您注册成为融资租赁公众号用户以接受本服务之前，您已充分阅读、理解并接受本协议的全部内容，一旦您使用本服务，即表示您同意遵循本协议之所有约定。</p>
                <p>您同意，本公司有权随时对本协议内容进行单方面的变更，并以网站公告的方式允以公布，无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应停止使用本服务。</p>
                <p>您声明，在您同意接受本协议并注册成为沃钱包用户时，您是具有法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人、法人或其他组织；不具备前述条件的，您应立即终止注册或停止使用本服务。</p>
                <br/>
                <p>二、“服务”使用规则</p>
                <br/>
                <p>为有效保障您使用本服务进行交易时的合法权益，您理解并同意接受以下规则：</p>
                <p>（一）一旦您使用本服务，您即授权本公司代理您在您及（或）您指定人符合指定条件或状态时，支付款项给您指定人，或收取您指定人支付给您的款项。</p>
                <p>（二）您使用本服务进行交易或使用该账户登录其他支持本服务的网站时，您即授权本公司将您的个人信息和交易信息披露给与您交易的另一方或您登录的网站，该信息包括但不限于：您的真实姓名、联系方式、信用状况、账户名等。</p>
                <p>（三）交易风险</p>
                <p>1.因您的过错导致的任何损失由您自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏密码，密码被他人破解，您使用的计算机被他人侵入。</p>
                <p>（四）您理解并同意，本公司不对因下述任一情况导致的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿 (无论本公司是否已被告知该等损害赔偿的可能性)：</p>
                <p>1.本公司有权基于单方判断，包含但不限于本公司认为您已经违反本协议的约定及精神，暂停、中断或终止向您提供本服务或其任何部分，并移除您的资料。 </p>
                <p>2.本公司在发现异常交易或有疑义或有违反法律规定或本协议约定之虞时，有权不经通知先行暂停或终止该账户的使用（包括但不限于对该账户名下的款项和在途交易采取取消交易、调账等限制措施），并拒绝您使用本服务之部分或全部功能。</p>
                <br/>
                <p>三、双方权利和义务</p>
                <br/>
                <p>（一）您的权利和义务</p>
                <p>1.您依法享有知悉其购买、使用支付产品，接受支付服务的权利。</p>
                <p>2.您使用本公司的支付服务过程中，可通过本公司网站的在线客服或客户服务电话与本公司联系，并获取相关的技术和服务支持。</p>
                <p>3.您不得把支付账户用于本协议约定范围以外的其他用途，也不得出租、转让给第三方使用。</p>
                <p>4.您使用本公司的网络支付服务时，应确保自身发出支付指令的合法性、真实性、有效性和完整性。</p>
                <p>5.您不得对本公司的支付服务系统和程序采取反向工程手段进行破解，不得对上述系统和程序（包括但不限于源程序、目标程序、软件文档、运行在本地电脑内存中的数据、客户端至服务器端的数据、服务器数据等）进行复制、修改、编译、整合和篡改，不得修改或增加本公司支付服务系统的原有功能。</p>
                <p>6.系统因下列状况无法正常运作，使您无法使用各项服务时，本公司不承担损害赔偿责任，该状况包括但不限于：本公司在本网站公告之系统停机维护期间；电信设备出现故障不能进行数据传输的；因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能执行业务的；由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。</p>
                <p>7.隐私权保护</p>
                <p>一旦您同意本协议或使用本服务，您即同意本公司按照以下条款来使用和披露您的个人信息。</p>
                <p>（1）银行账户信息：本公司所提供的服务将需要您提供您的银行账户信息，在您提供相应信息后，本公司将严格履行相关保密约定。</p>
                <p>（2）Cookie的使用：您了解并同意，本公司使用cookie来使本网站对用户更友好，它可以帮您省去为使用我们的服务而重复输入注册信息的麻烦和跟踪您的浏览器的状态。</p>
                <p>（3）第三方：除了本公司和您使用该账户成功登录过的其他网站，本公司不会向任何第三方提供、出售、出租、分享您的个人信息。除了按法定或约定情况下披露您的信息，本公司将恪尽善意管理人的义务。</p>
                <p>（4）安全：本公司仅按现有技术提供相应的安全措施来使本公司掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其它服务器备份数据和对用户密码加密。尽管有这些安全措施，但本公司不保证这些信息的绝对安全。</p>
                <br/>
                <p>（二）本公司的权利和义务</p>
                <p>1.本公司负责系统的建设、运行和管理，应确保该系统的安全性。</p>
                <p>2.本公司对您身份资料及信息负有保密义务，本公司不得利用您的上述信息从事超出法律许可及未经您授权的活动。</p>
                <p>3.本公司应保护双方合作期内获得的您身份基本信息、业务信息、会计档案等资料的安全，防止其被篡改、灭失、损毁或泄露。</p>
                <p>4.为提供更高效和优质的服务，本公司可根据运营需要对支付服务系统进行升级，因升级需要暂停或中止提供服务的，本公司提前在网站显著位置进行公告，并预告恢复日期。</p>
                <p>5.本公司可根据服务运营需要，对本协议的内容进行单方修改，但修改内容生效前应依照中国人民银行相关规定在本公司网站的显著位置公布最新的服务协议。</p>
                <p>6.本公司将根据但不限于您提供的证件号码，对您的身份进行判断和识别。本公司有权利在您参加对次数有限制的服务、活动中，根据掌握的身份判别信息，对同一自然人申请的，并同时享受服务或参加活动的多个会员账户进行相关处理。</p>
                <br/>
                <p>四、收费标准</p>
                <br/>
                <p>1.在您使用本服务时，本公司有权向您收取服务费用。本公司拥有制订及调整服务费之权利。具体服务费用以您使用本服务时本公司的公告或通知为准。</p>
                <p>2.除非另有说明或约定，您同意本公司有权自您委托本公司代管、代收或代付的款项中直接扣除上述服务费用。</p>
                <br/>
                <p>五、结束服务</p>
                <br/>
                <p>本公司不需对任何个人或第三方负责而随时中断服务。您对条款修改有异议，或对本公司的服务不满，可以行使如下权利：(1)停止使用本公司的服务；(2)通知本公司停止对您的服务。从那时起，您没有权利，本公司也没有义务传输和提供任何未处理的信息或未完成的服务给您或第三方。</p>
                <br/>
                <p>六、不可抗力及免责事由 </p>
                <br/>
                <p>1.不可抗力，是指不可预见、不可克服、即使预见亦无法避免的事件，该事件妨碍、影响或延误任何一方根据协议履行其全部或部分义务。该事件包括但不限于法律法规变化或有新的法律法规，政策调整或有新的政策规定，政府行为，自然灾害，战争，恐怖袭击或任何其它类似事件。 </p>
                <p>2.出现不可抗力事件时，知情的一方应及时以书面形式向对方发出通知，并告知对方该类事件对本协议产生或可能产生的影响，并应当在合理期限内提供相关证明。</p>
                <p>3.由于银行、电信运营商系统故障、调整升级，或电力中断，或现有技术能力无法防御的黑客攻击、技术故障等原因造成本公司支付服务系统无法正常运作的，不视为本公司违约。</p>
                <p>4.因上述不可抗力事件或免责事由致使本协议的部分或全部不能履行或延迟履行，甲、乙双方于彼此间不承担任何违约责任，但对怠于履行通知义务所导致的对方损失不能免责。</p>
                <p>5.本协议内受影响的条款可在不能履行的期间及受影响的范围内中止履行，待不可抗力情形消失后，双方应当恢复履行。</p>
                <br/>
                <p>七、有效期及其他条款</p>
                <br/>
                <p>本协议自您通过本公司网站或客户端勾选或点击同意之日起生效，有效期至本协议被解除或终止之日。</p>
                <br/>
                <p>八、 责任范围及责任限制</p>
                <br/>
                <p>（一） 本公司仅对本协议中列明的责任承担范围负责。</p>
                <p>（二）因交易所产生的任何风险应由您与交易对方承担。</p>
                <p>（三）用户信息是由用户本人自行提供的，本公司无法保证该信息之准确、及时和完整，您应对您的判断承担全部责任。</p>
                <p>（四）本公司不对交易标的及本服务提供任何形式的保证，包括但不限于以下事项：</p>
                <p>1.本服务符合您的需求。</p>
                <p>2.本服务不受干扰、及时提供或免于出错。</p>
                <p>3.您经由本服务购买或取得之任何产品、服务、资讯或其他资料符合您的期望。</p>
                <p>4.本服务之合作单位，所提供之服务品质及内容由该合作单位自行负责。</p>
                <p>5.您经由本服务之使用下载或取得任何资料，应由您自行考量且自负风险，因资料之下载而导致您电脑系统之任何损坏或资料流失，您应负完全责任。</p>
                <p>6.您自本公司及本公司工作人员或经由本服务取得之建议和资讯，无论其为书面或口头形式，均不构成本公司对本服务之保证。</p>
                <p>7.在法律允许的情况下，本公司对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），均不负有任何责任。</p>
                <p>8.除本协议另有规定外，在任何情况下，本公司对本协议所承担的违约赔偿责任总额不超过向您收取的当次服务费用总额。</p>
                <br/>
                <p>九、法律 </p>
                <br/>
                <p>1.本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。</p>
                <p>2.如发生本服务条款与中华人民共和国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它条款则依旧保持对用户产生法律效力和影响。</p>
                <p>3.因本协议产生之争议，均依照中华人民共和国法律予以处理，并以本公司住所地有管辖权的人民法院为管辖法院。</p>
            </div>
            </Fragment>
        )
    }

}

